INSERT INTO consumers(
	id, name, address)
VALUES (1, 'АО ВАРЯ', 'Сормовский'),
	(2, 'ГАЗ', 'Автозаводский'),
	(3, 'МП ВЕРА', 'Канавинский'),
	(4, 'МП', 'Канавинский'),
	(5, 'АО СТАЛЬ', 'Советский')
;

INSERT INTO suppliers(
	id, sername, address)
VALUES(1, 'Артюхина', 'Сормовский'),
	(2, 'Щепин', 'Приокский'),
	(3, 'Власов', 'Канавинский'),
	(4, 'Кузнецова', 'Советский'),
	(5, 'Цепилева', 'Нижегородский'),
	(6, 'Корнилов', 'Нижегородский')
;

INSERT INTO details(
	id, name, storage_address, quantity, price)
VALUES(1, 'Втулка', 'Сормовский', 20000, 5000),
	(2, 'Болт', 'Сормовский', 40000, 1000),
	(3, 'Ключ гаечный', 'Канавинский', 5000, 3000),
	(4, 'Шпилька', 'Автозаводский', 10000, 900),
	(5, 'Винт', 'Сормовский', 50000, 1500),
	(6, 'Молоток', 'Канавинский', 1200, 2000),
	(7, 'Шуруп', 'Сормовский', 30000, 1200)
;
INSERT INTO orders(
	id, consumer_id, supplier_id, detail_id, number_of_details, total)
VALUES(1, 5, 4, 3, 7, 21000),
	(2, 3, 3, 3, 2, 6000),
	(3, 4, 5, 4, 200, 180000),
	(4, 5, 4, 2, 50, 50000),
	(5, 1, 6, 7, 110, 132000),
	(6, 4, 4,	1, 150, 750000),
	(7, 2, 4, 6, 20, 40000),
	(8, 1, 3, 7, 2000,	2400000),
	(9, 2, 5, 7, 10000, 12000000),
	(10, 3, 6, 1, 5, 25000),
	(11, 4, 3, 3, 1, 3000),
	(12, 4, 4, 1, 10, 50000),
	(13, 1, 6, 6, 3, 6000),
	(14, 2, 1, 2, 1000, 1000000),
	(15, 2, 2, 1, 100, 5000000),
	(16, 5, 1, 5, 100, 15000),
	(17, 1, 4, 7, 12000, 24400000)
;
